app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
        #format.html { redirect_to @task, :notice => 'Task was successfully created.' }
        @tasks = Task.all
---
INSERT INTO "tasks" ("created_at", "memo", "taskName", "taskStatus", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 07 Apr 2013 11:53:18 UTC +00:00], ["memo", "めもめも"], ["taskName", "プログラミング"], ["taskStatus", 1], ["updated_at", Sun, 07 Apr 2013 11:53:18 UTC +00:00]]
SELECT "tasks".* FROM "tasks"

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "12"]]
UPDATE "tasks" SET "taskName" = 'ccc', "updated_at" = '2013-04-16 15:34:00.193496' WHERE "tasks"."id" = 12

  def add
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"